# 实验二 有线局域网组网与 VLAN 配置实验

实验目的

- 有线局域网的构建与单交换 VLAN 的配置
- 跨交换机 VLAN 配置
- 基于共享端口的跨交换机 VLAN 配置

## 2.1 单交换机 VLAN 的构建

熟悉 VLAN 的概念、掌握 cisco 交换机的 VLAN 的建立、删除方法，以及基于端口的 VLAN 分配方法。

### 实验设备与拓扑

![image-20241015184106621](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015184106621.png)

### 实验步骤

#### 创建单交换机网络

创建 2950-24 交换机并连接四台电脑，并手动分配静态IP。

![image-20241015192731518](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015192731518.png)

此时四台电脑处于联通状态，可以ping通。

![image-20241015192927742](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015192927742.png)



#### 创建 VLAN

在交换机中创建三个新的虚拟局域网并命名为 vlan2，vlan3，vlan4，并显示当前 VLAN 配置信息。

```
Switch>en
Switch#vlan database
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.

Switch(vlan)#vlan 2 name vlan2
VLAN 2 added:
    Name: vlan2
Switch(vlan)#vlan 3 name vlan3
VLAN 3 added:
    Name: vlan3
Switch(vlan)#vlan 4 name vlan4
VLAN 4 added:
    Name: vlan4
Switch(vlan)#exit
APPLY completed.
Exiting....
Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
2    vlan2                            active    
3    vlan3                            active    
4    vlan4                            active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
```



#### 删除 VLAN

```
Switch#vlan database
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.

Switch(vlan)#no vlan 4
Deleting VLAN 4...
Switch(vlan)#exit
APPLY completed.
Exiting....
Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
2    vlan2                            active    
3    vlan3                            active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
```



#### 给 VLAN 分配端口

切换到接口配置模式进行端口分配，将`Fa0/1`, `Fa0/2` 分配给 VLAN 2。

```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int range f0/1-2
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console
Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/3, Fa0/4, Fa0/5, Fa0/6
                                                Fa0/7, Fa0/8, Fa0/9, Fa0/10
                                                Fa0/11, Fa0/12, Fa0/13, Fa0/14
                                                Fa0/15, Fa0/16, Fa0/17, Fa0/18
                                                Fa0/19, Fa0/20, Fa0/21, Fa0/22
                                                Fa0/23, Fa0/24
2    vlan2                            active    Fa0/1, Fa0/2
3    vlan3                            active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active   
```

此时，PC0与PC1可以 ping 通，PC2与PC3可以 ping 通。但是处于不同 VLAN 下的设备无法互相 ping 通。VLAN 设置将此局域网下的设备分隔成了不同的虚拟局域网。

将`Fa0/3-4` 分配到 VLAN 3。

![image-20241015194751781](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015194751781.png)

#### 删除 VLAN

```
Switch#vlan database
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.

Switch(vlan)#no vlan 2
Deleting VLAN 2...
Switch(vlan)#no vlan 3
Deleting VLAN 3...
Switch(vlan)#exit
APPLY completed.
Exiting....
Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
```

#### 将 Fa0/1-4 重新分配给 VLAN 1

```
Switch#config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int range f0/1-4
Switch(config-if-range)#switchport access vlan 1
Switch(config-if-range)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
```



### 实验提高

![image-20241015195332677](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015195332677.png)

![image-20241015195348154](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015195348154.png)



## 2.2 跨交换机 VLAN 配置

### 实验设备与拓扑

![image-20241015200140461](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015200140461.png)

### 实验步骤

#### 建立网络拓扑

按照图片创建网络拓扑，并分配IP地址。

#### 创建 VLAN

在两台虚拟机中创建 vlan2 并将设备接口设置到 vlan2。

![image-20241015200329219](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015200329219.png)

#### 建立交换路径

为了在跨交换机的在 vlan2 的四台电脑能够属于一个 VLAN，彼此联通，需要用两个交换机为 vlan2 创建一条交换路径。

![image-20241015200605163](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015200605163.png)

此时 PC0 可以与 PC3（跨交换机）ping 通

```
C:\>ping 192.168.1.4

Pinging 192.168.1.4 with 32 bytes of data:

Request timed out.
Request timed out.
Reply from 192.168.1.4: bytes=32 time=1ms TTL=128
Reply from 192.168.1.4: bytes=32 time<1ms TTL=128

Ping statistics for 192.168.1.4:
    Packets: Sent = 4, Received = 2, Lost = 2 (50% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 1ms, Average = 0ms
```

### 实验提高

将PC0和PC2指定到 VLAN2，而PC1和PC3指定到 VLAN3.

首先在两个交换机创建 VLAN3

![image-20241015201111310](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015201111310.png)

然后Fa0/1分配为 VLAN2，Fa0/2分配为 VLAN3，而Fa0/3（交换机连接端口）设置为 trunk 模式。

## 2.3 基于共享端口的跨交换机 VLAN 配置实验

### 实验设备与拓扑

![image-20241015214118141](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015214118141.png)

### 实验步骤

#### 建立 VLAN

在两台交换机中分别都建立 VLAN2 和 VLAN3，将四台电脑接入交换机的 VLAN2 中。

```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int range f0/1-2
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console
Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/3, Fa0/4, Fa0/5, Fa0/6
                                                Fa0/7, Fa0/8, Fa0/9, Fa0/10
                                                Fa0/11, Fa0/12, Fa0/13, Fa0/14
                                                Fa0/15, Fa0/16, Fa0/17, Fa0/18
                                                Fa0/19, Fa0/20, Fa0/21, Fa0/22
                                                Fa0/23, Fa0/24
2    vlan2                            active    Fa0/1, Fa0/2
3    vlan3                            active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active   
```

#### 创建 Trunk 路径

将PC0和PC2接入 VLAN2，PC1和PC3接入 VLAN3，并为两个交换机连接的接口设置一个共享交换路径。

```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int f0/3
Switch(config-if)#switchport mode trunk

Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to up
end
Switch#
%SYS-5-CONFIG_I: Configured from console by console
```

测试PC的连通性

![image-20241015214816911](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015214816911.png)

测试发现在跨交换机的 VLAN 设置中，同 VLAN 可以通讯，不同则无法通讯。

### 实验提高

首先建立网络拓扑，在不设置 VLAN 的情况下测试连通性。

![image-20241015215212580](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015215212580.png)

在设置中设置接口给不同 VLAN，这是其中连接PC设备的 VLAN 设置信息。

```
Switch#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/3, Fa0/5, Fa0/6, Fa0/7
                                                Fa0/8, Fa0/9, Fa0/10, Fa0/11
                                                Fa0/12, Fa0/13, Fa0/14, Fa0/15
                                                Fa0/16, Fa0/17, Fa0/18, Fa0/19
                                                Fa0/20, Fa0/21, Fa0/22, Fa0/23
                                                Fa0/24
2    vlan2                            active    Fa0/1
3    vlan3                            active    Fa0/2
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
```

在switch0，switch1与前面步骤相同，在虚拟机相互连接的端口设置端口共享路径，将不同交换机不同 VLAN 下的设备联通。

![image-20241015215706896](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015215706896.png)

同时在第二级交换机（switch2）中，同样也需要设置三个不同的 VLAN

![image-20241015220255654](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015220255654.png)

最后测试连通性

![image-20241015220451145](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241015220451145.png)

发现同 VLAN 下的终端可以通信，而不同 VLAN 则不行，也就是 PC0-PC3, PC1-PC4, PC2-PC5可以相互通讯。
